[
    {
        "title": "Publishers - AI Book Recommender",
        "description": "A full-stack web application that helps authors find the perfect publishers for their books using AI-powered recommendations. Built with Next.js 15, Flask, and machine learning, it features JWT authentication, PDF upload with text extraction, a 3-step recommendation wizard, and real-time publisher matching. The system uses TF-IDF and genre detection algorithms to analyze manuscripts and match them with 294+ publishers. Includes comprehensive recommendation scoring based on genre, text similarity, and regional preferences.",
        "link": "https://github.com/swaraj404/publishers",
        "background": "/projects/sprunk/background.jpg"
    },
    {
        "title": "DeepDoc - AI PDF Chat System",
        "description": "An AI-powered PDF question-answering system that lets users chat with their documents. Built with Python, ChromaDB vector database, and Google Gemini AI. Features include intelligent PDF text extraction, semantic search using sentence transformers, confidence scoring, source attribution, and a beautiful Streamlit interface. The system processes PDFs into searchable chunks, stores them as vector embeddings, and retrieves relevant context for accurate AI-generated answers. Deployed with Docker support and production-ready API.",
        "link": "https://github.com/swaraj404/DeepDoc",
        "background": "/projects/find-your-tribe/background.jpg"
    },
    {
        "title": "Animation Showcase",
        "description": "A creative collection of modern web animations and interactive UI components built with cutting-edge frontend technologies. This project demonstrates advanced CSS animations, smooth transitions, parallax effects, and interactive elements. Features include creative scroll animations, dynamic hover effects, loading animations, and responsive design patterns. Built to showcase modern web development techniques and creative coding skills. Perfect demonstration of attention to detail and user experience design.",
        "link": "https://animations-theta-one.vercel.app/",
        "background": "/backgrounds/mountains.jpg"
    },
    {
        "title": "Koelai - Professional Work",
        "description": "Professional web development project showcasing modern design principles and technical expertise. Built with contemporary web technologies focusing on user experience, performance optimization, and scalability. This project represents professional-grade work with clean architecture, responsive design, and production-ready code. Demonstrates ability to deliver high-quality solutions for real-world applications with attention to detail, maintainability, and best practices in software development.",
        "link": "https://www.koelai.com/",
        "background": "/projects/sea-cracker/background.jpg"
    }
]
