[
    {
        "title": "Game Engine",
        "description": "Sprunk-engine is an open-source web game engine (available on npm) that I developed with some friends. We wanted a challenging, architecture-focused project, so we built a game engine with almost no external libraries. It lets developers create 2D browser games, and we made two demo games available on the official website. I worked on our custom math library, the 2D physics engine, and I’m now developing a new 3D physics engine. This project helped me deepen my understanding of algorithms, optimization, mathematics, and open-source collaboration.",
        "link": "https://sprunk-engine.com/",
        "background": "/projects/sprunk/background.jpg",
        "mobile_pic": "/projects/sprunk/web.png",
        "desktop_pic": "/projects/sprunk/template.jpg"
    },
    {
        "title": "Find your tribe",
        "description": "Find your tribe is a small project inspired by a music festival I attended abroad with friends. With over 60,000 people per day, it was nearly impossible to find each other once the group split up due to the crowd, noise, and lack of landmarks. The app solves this by letting users create groups to chat, see each other’s live locations, set and share map landmarks, and use 3D arrows powered by the phone’s gyroscope to point directly to their friends in real time. The 3D arrow feature is built using my modular “game engine” project.",
        "link": "https://github.com/orgs/retrouve-ta-tribu/repositories",
        "background": "/projects/find-your-tribe/background.jpg",
        "mobile_pic": "/projects/find-your-tribe/map.png",
        "desktop_pic": "/projects/find-your-tribe/irl.jpg"
    },
    {
        "title": "Portfolio",
        "description": "The portfolio project is the website you’re on right now. While many of my projects focus on architecture, algorithms, and data science, I’ve always had a strong passion for frontend development. I’ve long dreamed of becoming a “Creative Developer,” and I regularly explore awwwards.com for inspiration and to study the techniques behind advanced visual effects. This portfolio is both a way to present my work and a way to stay true to that ambition. If you have any suggestions or feedback, feel free to reach out!",
        "link": "https://github.com/Cyprien-png/portfolio",
        "background": "/backgrounds/mountains.jpg",
        "mobile_pic": "/projects/portfolio/contact.png",
        "desktop_pic": "/projects/portfolio/home.jpg"
    },
    {
        "title": "SeaCracker",
        "description": "SeaCracker is another open-source project I built with the same team as the game engine, a few months earlier. We wanted to explore design patterns and web app architecture, so we created a Kahoot-like platform where users can build quizzes and play them in live sessions. The host presents each question, while players join with their phones and submit answers like a remote control. A leaderboard is shown between questions to keep things engaging. This project introduced me to state machines, event-driven architecture, and gave me my first real experience with WebSockets.",
        "link": "https://github.com/orgs/SeaCrackers/repositories",
        "background": "/projects/sea-cracker/background.jpg",
        "mobile_pic": "/projects/sea-cracker/answer.png",
        "desktop_pic": "/projects/sea-cracker/question.jpg"
    }
]